class ModelDef {

	/**角色界面模型特殊显示的坐标 */
	public static ModelPlayerPos:any = {
		// "weapon": {
		// 	"0": {"x": -1010, "y": -1010},//默认
		// 	"1010001": {"x": -1000, "y": -1000},//新手武器
		// },
		// "wing": {
		// 	"0": {"x": -1000, "y": -1180},//默认
		// },
		// "spirit": {
		// 	"0": {"x": -360, "y": -700},//默认
		// }
		"weapon": {
			"0": {"x": 0, "y": 0},//默认
		},
		"wing": {
			"0": {"x": 2, "y": -164},//默认战士
			"1": {"x": 6, "y": -164}//法师和道士
		},
		"spirit": {
			"0": {"x": 140, "y": -210},//默认
		},
		"title": {
			"0": {"x":0,"y":-320}
		}
	}
}