class LangShapeBase {
    public static LANG1: string = "已达到最高等级";
    public static LANG2: string = "材料不足，无法提升";
    public static LANG3: string = "停  止";
    public static LANG4: string = "一键升星";
    public static LANG5: string = "1、使用<font color='#09c73d'>宠物进阶丹</font>可以提升宠物星数，每满10星可以提升到下一阶。" +
                                "\n2、宠物激活即可开启<font color='#09c73d'>百步穿杨</font>天赋，可跟随玩家进行作战。" +
                                "\n3、提升宠物等阶可以提升宠物的属性，解锁<font color='#09c73d'>坚壁、生机、锋芒、巨熊</font>等四个技能，提升战力，增强战场统治力。" +
                                "\n4、不同等级的宠物可以使用不同数量的<font color='#09c73d'>宠物潜能丹</font>和<font color='#09c73d'>宠物飞升丹</font>，飞速提升宠物的属性。" +
                                "\n5、宠物可穿戴<font color='#09c73d'>灵簪、灵佩、灵冠、灵珠</font>四种装备，为宠物穿戴装备可以大幅提升宠物的战力；宠物装备无穿戴等级限制，可以在<font color='#09c73d'>背包-合成</font>页面升级成更高品阶的宠物装备。" +
                                "\n6、在幻形界面可以<font color='#09c73d'>幻化</font>宠物的外形，获得额外的属性和战力；使用宠物进阶丹同样可以提升宠物幻形的等阶，解锁<font color='#09c73d'>技能</font>，助你掌控战场节奏。" +
                                "\n7、多个宠物幻形的天赋激活后可<font color='#09c73d'>同时生效</font>，无需幻化，幻化只是改变宠物的外观。";

    public static LANG6: string = "1.使用<font color ='#09c73d'>坐骑进阶丹</font>可以提升坐骑星级，每满10星即可以提升到下一阶。" +
                                "\n2.坐骑幻化激活后即可开启对应天赋，提升对应系统的属性。" +
                                "\n3.提升坐骑等级可以提升坐骑的属性，解锁坐骑的四个技能，提升战力，增强战场统治力。" +
                                "\n4.坐骑可穿戴<font color ='#09c73d'>缰绳、鞍饰、马镫、足饰</font>四种装备，为坐骑穿戴装备可以大幅提升坐骑的战力；坐骑装备无穿戴等级限制，可以在<font color ='#09c73d'>背包-合成</font>页面升级成更高品质的坐骑装备。" +
                                "\n5.在幻形界面可以<font color ='#09c73d'>幻化</font>坐骑的外形，获得额外的属性和战力，使用坐骑进阶丹同样可以提升坐骑幻形的等级，解锁<font color ='#09c73d'>天赋</font>和<font color ='#09c73d'>技能</font>，助你掌控战场节奏。" +
                                "\n6.多个坐骑幻形的天赋激活后可<font color ='#09c73d'>同时生效</font>，无需幻化，幻化只改变坐骑的外观。";

    public static LANG7: string = "1、使用<font color='#09c73d'>战阵灵丹</font>可以提升战阵星数，每满10星可以提升到下一阶。" +
                                "\n2、战阵幻形激活后即可开启对应天赋，提升对应系统的属性。" +
                                "\n3、提升战阵等阶可以提升战阵的属性，解锁战阵的四个技能，提升战力，增强战场统治力。" +
                                "\n4、战阵可穿戴<font color='#09c73d'>阵魂、阵尘、阵芒、阵印 </font>四种装备，为战阵穿戴装备可以大幅提升战阵的战力；战阵装备无穿戴等级限制，可以在<font color='#09c73d'>背包-合成</font>页面升级成更高品阶的战阵装备。" +
                                "\n5、在幻形界面可以<font color='#09c73d'>幻化</font>战阵的外形，获得额外的属性和战力；使用战阵进阶丹同样可以提升战阵幻形的等阶，解锁<font color='#09c73d'>天赋</font>和<font color='#09c73d'>技能</font>，助你掌控战场节奏。" +
                                "\n6、多个战阵幻形的天赋激活后可<font color='#09c73d'>同时生效</font>，无需幻化，幻化只改变战阵的外观。";

    public static LANG8: string = "1、使用<font color='#09c73d'>法阵灵丹</font>可以提升法阵星数，每满10星可以提升到下一阶。" +
                                "\n2、法阵幻形激活后即可开启对应天赋，提升对应系统的属性。" +
                                "\n3、提升法阵等阶可以提升法阵的属性，解锁法阵的四个技能，提升战力，增强战场统治力。" +
                                "\n4、法阵可穿戴<font color='#09c73d'>阵眼、阵灵、阵纹、阵诀 </font>四种装备，为法阵穿戴装备可以大幅提升法阵的战力；法阵装备无穿戴等级限制，可以在<font color='#09c73d'>背包-合成</font>页面升级成更高品阶的法阵装备。" +
                                "\n5、在幻形界面可以<font color='#09c73d'>幻化</font>法阵的外形，获得额外的属性和战力；使用法阵进阶丹同样可以提升法阵幻形的等阶，解锁<font color='#09c73d'>天赋</font>和<font color='#09c73d'>技能</font>，助你掌控战场节奏。" +
                                "\n6、多个法阵幻形的天赋激活后可<font color='#09c73d'>同时生效</font>，无需幻化，幻化只改变法阵的外观。";

    public static LANG9: string = "1、使用<font color='#09c73d'>剑池灵丹</font>可以提升剑池星数，每满10星可以提升到下一阶。" +
                                "\n2、剑池幻形激活后即可开启对应天赋，提升对应系统的属性。" +
                                "\n3、提升剑池等阶可以提升剑池的属性，解锁剑池的四个技能，提升战力，增强战场统治力。" +
                                "\n4、剑池可穿戴<font color='#09c73d'>剑刃、剑格、剑柄、剑穗 </font>四种装备，为剑池穿戴装备可以大幅提升剑池的战力；剑池装备无穿戴等级限制，可以在<font color='#09c73d'>背包-合成</font>页面升级成更高品阶的剑池装备。" +
                                "\n5、在幻形界面可以<font color='#09c73d'>幻化</font>剑池的外形，获得额外的属性和战力；使用剑池进阶丹同样可以提升剑池幻形的等阶，解锁<font color='#09c73d'>天赋</font>和<font color='#09c73d'>技能</font>，助你掌控战场节奏。" +
                                "\n6、多个剑池幻形的天赋激活后可<font color='#09c73d'>同时生效</font>，无需幻化，幻化只改变剑池的外观。";

    public static LANG10: string = "道具已过期，使用后将获得{0}铜钱，确定使用吗？";

    public static LANG11: string = "确定使用宠物进阶丹提升宠物吗？\n说明：宠物等阶在5阶才能使用，使用后直升1阶，超过5阶使用获得50个宠物进阶丹。强烈推荐在宠物5阶的时候使用";
    public static LANG12: string = "确定使用宠物直升丹提升宠物吗？\n说明：宠物等阶在4阶及以下使用可以直升1阶，超过4阶使用获得300个宠物进阶丹。强烈推荐在宠物4阶的时候使用。";
    public static LANG13: string = "宠物等阶在5阶才能使用";

    public static LANG14: string = "确定使用战阵进阶丹提升战阵吗？\n说明：战阵等阶在5阶才能使用，使用后直升1阶，超过5阶使用获得50个战阵灵丹。强烈推荐在战阵5阶的时候使用";
    public static LANG15: string = "确定使用战阵直升丹提升战阵吗？\n说明：战阵等阶在4阶及以下使用可以直升1阶，超过4阶使用获得300个战阵灵丹。强烈推荐在战阵4阶的时候使用。";
    public static LANG16: string = "战阵等阶在5阶才能使用";

    public static LANG17: string = "确定使用剑池进阶丹提升剑池吗？\n说明：剑池等阶在5阶才能使用，使用后直升1阶，超过5阶使用获得50个剑池灵丹。强烈推荐在剑池5阶的时候使用";
    public static LANG18: string = "确定使用剑池直升丹提升剑池吗？\n说明：剑池等阶在4阶及以下使用可以直升1阶，超过4阶使用获得300个剑池灵丹。强烈推荐在剑池4阶的时候使用。";
    public static LANG19: string = "剑池等阶在5阶才能使用";

    public static LANG20: string = "确定使用法阵进阶丹提升法阵吗？\n说明：法阵等阶在5阶才能使用，使用后直升1阶，超过5阶使用获得50个法阵灵丹。强烈推荐在法阵5阶的时候使用";
    public static LANG21: string = "确定使用法阵直升丹提升法阵吗？\n说明：法阵等阶在4阶及以下使用可以直升1阶，超过4阶使用获得300个法阵灵丹。强烈推荐在法阵4阶的时候使用。";
    public static LANG22: string = "法阵等阶在5阶才能使用";

    public static LANG23: string = "1.使用<font color ='#09c73d'>羽毛</font>可以提升翅膀星级，每满10星即可以提升到下一阶。" +
                                "\n2.翅膀幻形激活后即可开启对应天赋，提升对应系统的属性。" +
                                "\n3.提升翅膀等级可以提升翅膀的属性，解锁翅膀的五个技能，提升战力，增强战场统治力。" +
                                "\n4.翅膀的神羽界面可装备<font color ='#09c73d'>飞羽、纤羽、绒羽、翎羽</font>四种神羽，为翅膀大幅提升战力；神羽无穿戴等级限制，击杀<font color ='#09c73d'>神域BOSS</font>有几率掉落神羽碎片，在<font color ='#09c73d'>合成界面</font>合成神羽。" +
                                "\n5.在幻形界面可以<font color ='#09c73d'>幻化</font>翅膀的外形，获得额外的属性和战力，使用羽毛可以提升翅膀幻形的等级，解锁<font color ='#09c73d'>技能</font>，使用幻形道具可升级<font color ='#09c73d'>天赋</font>，助你掌控战场节奏。" +
                                "\n6.多个翅膀幻形的天赋激活后可<font color ='#09c73d'>同时生效</font>，无需幻化，幻化只改变翅膀的外观。";
    
    public static LANG24: string = "{0}不足";
    public static LANG25: string = "道具不足";
}