class LangNetwork
{
    public static LANG: Array<string> = [
        "重启网关服务器！",
        "重启CELL服务器！",
        "重启网关管理服务器！",
        "请重新登录！",
        "共用服务器关闭！",
        "数据库关闭！",
        "你的账号在其他地方登录！",
        "您已经进入不健康游戏时间，请合理安排游戏时间",
        "您的累计下线时间不满5小时！",
        "你的账号被锁定，请联系GM!",
        "服务器进行维护，请稍后登录",
        "保存数据出错！",
        "版本错误！",
        "检测您使用第三方软件，请关闭软件再登录游戏"];
    public static LANG2:string = "已停止心跳";
    /**非调试模式提示内容 */
    public static LANG3: Array<string> = [
        "您的网络不稳定，请重新登录！",
        "您的网络不稳定，请重新登录！",
        "您的网络不稳定，请重新登录！",
        "您的网络不稳定，请重新登录！",
        "共用服务器关闭！",
        "数据库关闭！",
        "你的账号在其他地方登录！",
        "您已经进入不健康游戏时间，请合理安排游戏时间",
        "您的累计下线时间不满5小时！",
        "你的账号被锁定，请联系GM!",
        "服务器进行维护，请稍后登录",
        "保存数据出错！",
        "版本错误！",
        "检测您使用第三方软件，请关闭软件再登录游戏"];
}