class RandName {
	public static firstNames: Array<any> = 
		["沐","言","君","墨","戚","陶","华","谢","姬","景","宫","伊","唐","景","萧","宁","蓝","楼","步",
        "卿","连","颜","凌","苏","洛","冷","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏",
		"窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任",
		"欧阳","端木","上官","司马","东方","独孤","南宫","万俟","夏侯","诸葛","尉迟","赫连","澹台","皇甫","政",
		"濮阳","公冶","申屠","公孙","慕容","仲孙","钟离","长孙","拓跋","轩辕","百里","呼延","东郭","南门",
		"仲长","达奚","淳于","紫霄宗灬","天道灬","九天灬","青天门灬","天音灬","灵门灬","无极灬",
		"五行灵灬","玄天灬","古月灬","龙门灬","赤血灬","天魔灬","碧凌灬","玄音灬","生死门灬","天心灬",
		"隐神灬","碧云轩灬","焚香灬","无心灬","天元灬","元明De","灵云De","药王De","灵鬼De","梦仙De","剑幽De",
		"飘渺De","医仙De","苍穹•","逍遥•","九天•","天香•","青云•","天音•","合欢•","仙鬼•",
		"鬼王o","天华","鬼域灬","霸气o","顶灬尖","神o","巅峰o","君临•","修罗•","孤城•","末世灬","求败•","情谊De",
		"战斧灬","漠o","半度•","浅斟朱颜•","碧落红尘•","歌里繁华•","花前月下•","空浮鸢o","妖末o","卿飒o","朱砂o",
		"醉花荫o","花镜De","胤墨De","红颜泪•","蓝颜醉•"];

	public static secondMan0: Array<any> = 
		["洛","璟","煜","睿","晨","熠","悟","烜","轩","珸","羽","沺","阳","煦","灿","耀","烨","诺","跃","峥","知",
		"智","旭","珝","珬","珂","炎","珚","彦","琰","琅","朗","卓","琢","凡","思","宇","郁","嘉","哲","俊","博",
		"佳","宇","泽","子","奕","依","浩","泓","凯","吉","源","渊","和","健","信","荣","明","雄","义","卿","乾",
		"亦","昊","芸","岚","鸿","宸","坤","恒","渝","龄","弘","佩","勋","晋","逸","沅","倩","圣","承","民","智",
		"棠","恩","羽","旭","维","家","谚","阳","国","仑","德","易","真","之","凰","桦","彦","冠","益","劭","钧",
		"瀚","桓","东","滢","恬","瑾","达","群","茜","先","洲","溢","楠","基","轩","森","凌","霸","冲","志","留",
		"博","才","光","弘","灿","俊","凯","乐","良","明","健","辉","天","星","永","修","义","嘉","成","傲","智"];

	public static secondMan1: Array<any> = 
		["败","悔","南","宝","仞","刀","斐","德","云","天","仁","岳","宵","忌","爵","权","敏","阳","狂","冠","康","平",
		"刚","强","凡","邦","福","歌","国","和","康","澜","民","宁","然","顺","翔","晏","宜","易","志","雄","佑","斌",
		"河","元","墨","松","林","之","翔","竹","宇","轩","荣","哲","风","霜","山","炎","罡","盛","睿","达","洪","武",
		"耀","磊","寒","冰","潇","痕","空","忌","爵","权","敏","阳","狂","冠","康","平","刚","强","凡","邦","福","歌",
		"国","和","康","澜","民","宁"];

	public static secondWoman0: Array<any> = 
		["伊","棋","文","星","雨","贞","丽","凝","绮","仪","楠","语","珍","姜","奴","芊","梦","秀","玉","菲","女","茜","纹",
		"旭","渺","姝","娇","桃","霜","雯","絮","育","涟","姣","偀","彤","妩","萱","采","偲","妹","凤","倩","南","亿","钰","璐",
		"洁","盼","嫱","姯","滢","彨","颜","玫","婵","柔","希","妶","倪","茹","芬","清","红","翠","旋","煜","真","碧","赫","慕",
		"曦","雁","瑷","芝","姑","婷","漪","宝","桂","竹","欢","姿","澜","彩","冷","听","画","枝","婕","淑","芙","禧","波","雅",
		"芷","姐","沛","巧","霖","萌","晗","荔","莎","兰","怜","寻","黛","毓","珠","春","俪","晨","莹","容","妍","寒","锦","佩",
		"芹","娣","灵","园","烁","倰","瑛","琴","情","漩","媛","环","霏","芃","湾","贻","璇","荷","嫂","檀","融","勤","霞","颖"];
	
	public static secondWoman1: Array<any> = 
		["楚","漫","璧","梅","娈","芯","可","炎","玟","林","屏","忆","音","姹","妙","慧","蓉","嫦","若","代","华","瑶","念","英",
		"莓","婉","蝶","淼","悦","火","姗","莉","盈","欣","如","馥","姬","馡","依","谷","翎","瑜","娅","珆","燕","菱","琳","伶",
		"羽","越","姞","菊","萍","琬","荣","梓","枫","冽","娟","芮","薇","炅","思","云","佳","君","艾","烟","瑞","含","芸","玲",
		"茵","叆","好","歆","嫣","韵","嘉","筠","琪","媚","媱","珴","昭","冰","珂","纯","宜","琼","妮","芳","妆","姳","琦","冉",];
}